# 1) Importing libraries

In [2]:
# Importing libraries
import pandas as pd
import numpy as np
import os

# 2) Importing CSV files

In [3]:
# Create a string of the path for your main project folder
path = r'C:\Users\GTSA - Infinity\Documents\Analytika career foundry\Task 4 PYTHON\Instacart Basket Analysis'

In [4]:
# Importing products.csv 
df_prods = pd.read_csv(os.path.join(path, '02 Original Data', 'products.csv'), index_col = False)

In [5]:
# Importing orders_wrangled.csv
df_ords = pd.read_csv(os.path.join(path, '02 Original Data', 'orders.csv'), index_col = False)

# 3) Data consistency check

In [6]:
df_ords.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [7]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [8]:
# Max price in the column prices seems not right (price $99,999) if the mean in the column prices is $9,994 and std is $453,51.

# 4) Mixed-type data check

In [9]:
# Create a dataframe
df_test = pd.DataFrame()

In [10]:
# Create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [11]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [12]:
# Checking a dataframe for mixed-type column
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [13]:
# Changing data type for column mix to string
df_test['mix'] = df_test['mix'].astype('str')

# 5) Check for mixed-type data in your df_ords dataframe

In [14]:
#Checking for mixed-type data
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

In [15]:
# There are no mixed-type data.

# 6) Run a check for missing values

In [16]:
# finding missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [ ]:
# 16 missing values

In [17]:
# Creating a subset of these missing values
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [18]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

# 7) Addressing the missing values

In [19]:
# Comparing the number of rows
df_prods.shape

(49693, 5)

In [20]:
# Creating new df
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [21]:
# Comparing the number of rows with previous number of rows
df_prods_clean.shape

(49677, 5)

# 8) Running a check for duplicate values

In [22]:
#Looking for duplicates 
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [23]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [24]:
# Addressing duplicates
df_prods_clean.shape

(49677, 5)

In [25]:
# New set with no duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [26]:
# Checking the shape of the cleaned data
df_prods_clean_no_dups.shape

(49672, 5)

In [27]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [ ]:
# Mean price is $9.99 and the max price is $99999 which seems not realiable. Rest of the statistical description is showing relevant data.

In [28]:
#Checking for mixed-type data
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

In [ ]:
# There are no mixed-type data.

In [29]:
# finding missing values
df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [31]:
# Finding unique values for each column
print(df_ords.nunique())

order_id                  3421083
user_id                    206209
eval_set                        3
order_number                  100
order_dow                       7
order_hour_of_day              24
days_since_prior_order         31
dtype: int64

In [ ]:
# Column Days_since_prio_order has the same number of missing values as the column user_id. There are missing values for all first orders.

# 9) Addressing the duplicates

In [32]:
# Replacing all missing values in the days since prior order with 0
df_ords['days_since_prior_order'].fillna( 0 , inplace=True)

In [33]:
# Finding missing values
df_ords.isnull().sum()

order_id                  0
user_id                   0
eval_set                  0
order_number              0
order_dow                 0
order_hour_of_day         0
days_since_prior_order    0
dtype: int64

In [34]:
#Looking for full duplicates in your dataframe
df_ords_dups = df_ords[df_ords.duplicated()]

In [35]:
# Checking list created
df_ords_dups.head()

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order]
Index: []

In [ ]:
# There are not any duplicates.

# 10) Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data”

In [36]:
#exporting cleaned orders file 
df_ords.to_csv(os.path.join(path, '02 Original Data', 'Prepared Data', 'orders_cleaned.csv'))

In [38]:
#exporting cleaned products file
df_prods_clean.to_csv(os.path.join(path, '02 Original Data', 'Prepared Data', 'products_cleaned.csv'))